[
  {
    "id": 1,
    "name": "Susan B",
    "location": "Charlotte, NC",
    "rating": 5,
    "text": "After submitting an online inquiry for quotes regarding a huge oil slick in the garage, Devin called promptly & explained options. Several days later we scheduled the appt. in which he was on time & prepared. As mentioned in conversation, he explained the type of acid may not be strong enough for the severity of stain but worth a try. Initially it appeared most of it came off. I was very pleased & his amount charged was quite fair. However, once it dried, the stain was still prominent. Definitely not his fault, I do plan to contact him again down the road & we'll try the stronger solution. Very nice & knowledgeable, you can't go wrong",
    "service": "residential-pressure-washing",
    "date": "2024-02-15"
  },
  {
    "id": 2,
    "name": "Chris Roberts",
    "location": "Matthews, NC",
    "rating": 5,
    "text": "We really like the results after soft washing our house and pressure washing our very dirty driveway. I fully recommend NOVELLI pressure washing services and plan to use them next time we need cleaning services.",
    "service": "soft-washing",
    "date": "2024-01-20"
  },
  {
    "id": 3,
    "name": "Dannethia Little",
    "location": "Huntersville, NC",
    "rating": 5,
    "text": "I got this awesome Power Wash company from Angi list. Very professional, respect and reliable. I had got another quote from another company twice the price. Awesome job. Thank you Devin.",
    "service": "residential-pressure-washing",
    "date": "2023-12-05"
  },
  {
    "id": 4,
    "name": "Christopher Gibson",
    "location": "Concord, NC",
    "rating": 5,
    "text": "Devin has done a great job for power-washing overall process was smooth told him what areas needed work on and he did an outstanding job would recommend him in the future.",
    "service": "residential-pressure-washing",
    "date": "2023-11-12"
  },
  {
    "id": 5,
    "name": "David Thompson",
    "location": "Charlotte, NC",
    "rating": 5,
    "text": "I'm extremely satisfied with the work Novelli did on our home. They pressure washed our siding, driveway, and deck, and everything looks incredible. The attention to detail was impressive.",
    "service": "residential-pressure-washing",
    "date": "2023-10-30"
  },
  {
    "id": 6,
    "name": "Jennifer Martinez",
    "location": "Gastonia, NC",
    "rating": 5,
    "text": "Novelli Pressure Washing transformed our restaurant's exterior and patio area. Their commercial cleaning service was thorough and efficient. Our customers have been commenting on how clean everything looks!",
    "service": "commercial-pressure-washing",
    "date": "2023-09-18"
  }
]
